Repository: banhhschung/fire_alarm_app
Catalog: lib/l10n/intl_*.arb
Languages: vi

# can_not_connect_to_server
source: No connection. Please check the connection.
vi: Không có kết nối internet, vui lòng kiểm tra lại

# phone_not_registered_warning
source: Phone number is not registered
vi: Số điện thoại chưa được đăng ký

# email_not_registered_warning
source: Email is not registered
vi: Email chưa được đăng ký

# wrong_login_information
source: Login information wrong
vi: Thông tin đăng nhập không đúng

source: Login failed, please try again
vi: Đăng nhập không thành công, vui lòng thử lại

source: Login
vi: Đăng nhập

source: Register
vi: Đăng ký

source: Phone number
vi: Số điện thoại

source: Enter phone number or email
vi: Nhập số điện thoại hoặc email

source: Password
vi: Mật khẩu

source: Enter password
vi: Nhập mật khẩu

# forgot_pass
source: Forgot password ?
vi: Quên mật khẩu?

source: Full name
vi: Họ và tên

# enter_your_full_name
source: Enter full name
vi: Nhập họ và tên

source: Enter password again
vi: Nhập lại mật khẩu

# password_length_requite
source: 6-12 characters, written at once, without diacritics
vi: 6-12 kí tự, viết liền, không dấu

# password_capital_letters_requite
source: There are uppercase and lowercase letters
vi: Có chữ hoa và chữ thường

source: Save password
vi: Lưu mật khẩu

# you_not_have_account
source: You do not have an account?
vi: Bạn chưa có tài khoản?

source: You have account?
vi: Bạn đã có tài khoản?

# login_text_empty_warning
source: You need to enter login information
vi: Bạn cần nhập đầy đủ thông tin đăng nhập

# email_phone_invalid_warning
source: Phone number or email invalid
vi: Số điện thoại hoặc email không hợp lệ

source: Do not have device
vi: Chưa có thiết bị

source: Add device
vi: Thêm thiết bị

source: Choose device type
vi: Chọn loại thiết bị

source: Connect device
vi: Kết nối thiết bị

source: Device code
vi: Mã thiết bị

# add_barcode_or_enter_code_on_device
source: Scan Serial barcode or enter code on device
vi: Quét barcode Serial hoặc nhập mã trên thiết bị

# enter_button_3_times_util_light_flash
source: Press the reset button continuously 3 times at 3 second intervals until the light flashes
vi: Nhấn nút đặt lại liên tục 3 lần trong khoảng thời gian 3 giây cho đến khi đèn nhấp nháy

# you_need_scan_device_code
source: You can scan or enter device code
vi: Bạn cần quét hoặc nhập mã thiết bị

source: Device type
vi: Loại thiết bị

# time_to_connect_device
source: Device connect time
vi: Thời gian kết nối thiết bị

# connect_device_fail
source: Connect device unsuccessful
vi: Kết nối thiết bị không thành công

source: Add device success
vi: Thêm thiết bị thành công

source: Try again
vi: Thử lại

source: Complete
vi: Hoàn thành

# continued
source: Continue
vi: Tiếp tục

source: Choose continue
vi: Chọn tiếp tục

source: Pairing success
vi: Kết nối thành công

source: Pairing failure
vi: Kết nối thất bại

source: Diagram
vi: Mô hình

source: Connected
vi: Kết nối

source: Lost connected
vi: Mất kết nối

source: Warning history
vi: Lịch sử cảnh báo

source: Personal information
vi: Thông tin cá nhân

source: Date of birth
vi: Ngày sinh

source: Gender
vi: Giới tính

source: Change password
vi: Đổi mật khẩu

source: Edit information
vi: Chỉnh sửa thông tin

source: Save information
vi: Lưu thông tin

source: Old password
vi: Mật khẩu cũ

source: New password
vi: Mật khẩu mới

source: Re-enter password
vi: Nhập lại mật khẩu

source: Building management
vi: Quản lý toà nhà

source: Add house
vi: Thêm nhà

source: House
vi: Nhà

source: Building name
vi: Tên toà nhà

source: Address
vi: Địa chỉ

source: Province/City
vi: Tỉnh/Thành phố

source: District/Town
vi: Quận/Huyện/Thị xã

source: Specific address
vi: Địa chỉ cụ thể

source: Choose
vi: Chọn

source: Enter
vi: Nhập

source: Floor-Room
vi: Tầng-Phòng

source: Floor list
vi: Danh sách tầng

source: Add floor
vi: Thêm tầng

source: Floor name
vi: Đặt tên tầng

source: Room list
vi: Danh sách phòng

source: Room equipment
vi: Thiết bị trong phòng

source: Room name
vi: Tên phòng

source: Update current location
vi: Cập nhật vị trí hiện tại

source: Device management
vi: Quản lý thiết bị

source: Search
vi: Tìm kiếm

source: Add members
vi: Thêm thành viên

source: House owner
vi: Chủ nhà

source: Relatives
vi: Người thân

source: Guest
vi: Khách

source: Add share
vi: Thêm chia sẻ

source: Open App
vi: Mở Ứng dụng

source: Select Menu
vi: Chọn Menu

source: Click QR code
vi: Nhấn mã QR

# three_steps_to_open_the_shared_code_of_the_shared_member
source: 3 Steps to open the shared code of the shared member
vi: 3 Bước mở mã chia sẻ của người được chia sẻ

source: Shared code
vi: Mã chia sẻ

source: Account type
vi: Loại tài khoản

source: Share all devices
vi: Chia sẻ tất cả thiết bị

# share_all_devices_hint_text
source: All devices in the house will be shared. Please consider to ensure privacy and security for your home.
vi: Tất cả thiết bị trong ngôi nhà sẽ được chia sẻ. Hãy cân nhắc để đảm bảo sự riêng tư và an toàn cho ngôi nhà của bạn.

source: female
vi: Nữ

source: male
vi: Nam

source: Enter email address
vi: Nhập địa chỉ email

# name_empty
source: Full name cannot be empty
vi: Họ tên không được để trống

# email_phone_empty
source: Email/phone cannot be empty
vi: Email/số điện thoại không được để trống

# password_empty
source: Password cannot be empty
vi: Mật khẩu không được để trống

# email_phone_wrong_format
source: Incorrect email/phone number format
vi: Không đúng định dạng email/số điện thoại

# wrong_password_format
source: Password format wrong
vi: Mật khẩu không hợp lệ

# confirm_password_empty
source: Enter your password again
vi: Hãy nhập lại mật khẩu

# not_matched_password
source: Re-enter incorrect password
vi: Nhập lại mật khẩu không đúng

source: Email was registered
vi: Email này đã được đăng kí

source: Phone number was registered
vi: Số điện thoại này đã được đăng kí

source: Failed, please try again.
vi: Không thành công, vui lòng thử lại.

# sent_sms_limit
source: Sent SMS max in day. Please try again tomorrow.
vi: Đã gửi quá giới hạn mã trong ngày. Hãy thử lại vào ngày mai.

source: Confirm OTP
vi: Xác nhận OTP

source: Please enter the code we sent you via phone number
vi: Vui lòng nhập mã số chúng tôi gửi cho bạn qua số điện thoại

source: Logout
vi: Đăng xuất

source: Do you want to logout
vi: Bạn có muốn đăng xuất không

source: Ignore
vi: Bỏ qua

source: Accept
vi: Đồng ý

source: Language
vi: Ngôn ngữ

source: Please enter current password.
vi: Hãy nhập mật khẩu hiện tại.

source: Old password is incorrect.
vi: Mật khẩu cũ không đúng.

source: Please re-enter password.
vi: Hãy nhập lại mật khẩu.

source: Re-enter incorrect password.
vi: Nhập lại mật khẩu không đúng.

source: Notification
vi: Thông báo

source: Password changed successfully. Please log in again with the new password.
vi: Đổi mật khẩu thành công. Hãy đăng nhập lại bằng mật khẩu mới.

source: You need to enter the building name.
vi: Bạn cần nhập tên toà nhà.

source: You need to enter a building name of less than 25 characters.
vi: Bạn cần nhập tên toà nhà ít hơn 25 ký tự.

source: You need to enter the building address.
vi: Bạn cần nhập địa chỉ toà nhà.

source: Successfully created new building.
vi: Tạo mới toà nhà thành công.

source: Creating new building failed, please try again.
vi: Tạo mới toà nhà không thành công, vui lòng thử lại.

source: Save
vi: Lưu

source: Update successful.
vi: Cập nhật thành công.

source: Update failed, please try again.
vi: Cập nhật không thành công, vui lòng thử lại.

source: Rename floor
vi: Đổi tên tầng

# floor_name_title_input_text
source: Floor name
vi: Tên tầng

source: You need to enter the floor name.
vi: Bạn cần nhập tên tầng.

source: Rename room
vi: Đổi tên phòng

source: Do you want to delete this room?
vi: Bạn có muốn xoá phòng này không?

source: Share management
vi: Quản lý chia sẻ

source: Add member successful.
vi: Thêm thành viên thành công.

source: Invalid sharing account.
vi: Tài khoản chia sẻ không hợp lệ.

source: This account already exists.
vi: Tài khoản này đã tồn tại.

source: Sharing failed, please try again.
vi: Chia sẻ thất bại, vui lòng thử lại.

source: You need to enter the sharing code, email or phone number of the shared account.
vi: Bạn cần nhập mã chia sẻ, email hoặc số điện thoại của tài khoản được chia sẻ.

source: Delete
vi: Xoá

source: Share settings
vi: Thiết lập chia sẻ

source: Do you want to delete the share?
vi: Bạn có muốn xoá chia sẻ?

source: The selected time must be greater than the current time.
vi: Thời gian lựa chọn phải lớn hơn thời gian hiện tại.

source: Emergency fire alarm
vi: Báo cháy khẩn cấp

source: Location
vi: Vị trí

source: Network connection
vi: Mạng kết nối

source: Child devices
vi: Thiết bị con

source: Low battery
vi: Pin yếu

source: OTP code expires after
vi: Mã OTP hết hạn sau

source: second
vi: giây

source: Send back
vi: Gửi lại

source: OTP code has expired.
vi: Mã OTP đã hết hạn.

source: OTP code is incorrect.
vi: Mã OTP không đúng.

source: Resend OTP code
vi: Gửi lại mã OTP

source: Device details
vi: Chi tiết thiết bị

source: Delete device
vi: Xoá thiết bị

source: Set up warning sounds
vi: Cài đặt âm thanh cảnh báo

source: Please press and hold the button on the device until the light flashes.
vi: Vui lòng nhấn và giữ nút trên thiết bị cho tới khi đèn nhấp nháy.

source: Device information
vi: Thông tin thiết bị

source: Network connection configuration
vi: Cấu hình mạng kết nối

source: Device naming
vi: Đặt tên thiết bị

source: Warranty information
vi: Thông tin bảo hành

source: Device parameters
vi: Tham số thiết bị

source: Version
vi: Phiên bản

source: Device name cannot be longer than 50 characters.
vi: Tên thiết bị không được dài quá 50 ký tự.

source: Device name cannot be blank.
vi: Tên thiết bị không được để trống.

source: Expiration date
vi: Ngày hết hạn

source: Select preferred network when connecting
vi: Lựa chọn mạng kết nối ưu tiên khi kết nối

source: Set warning time
vi: Cài đăt thời gian cảnh báo

source: Users can customize the confirmation time before the system sends an alert.
vi: Người dùng có thể tùy chỉnh thời gian xác nhận trước khi hệ thống gửi cảnh báo.

source: Warning confirmation time
vi: Thời gian xác nhận cảnh báo

source: minute
vi: phút

source: Choose time
vi: Chọn thời gian

source: Are you sure you want to erase the device?
vi: Bạn có chắc chắn muốn xoá thiết bị?

source: Mode
vi: Chế độ

# important_warnings_related_to_security_hazard_detection_incidents_etc
source: Important warnings related to security, hazard detection, incidents,...
vi: Các cảnh báo quan trọng liên quan đến an ninh, phát hiện nguy hiểm, sự cố,...

source: Sound
vi: Âm thanh

source: Warning sound cycle
vi: Chu kỳ âm thanh cảnh báo

source: Send warning later
vi: Gửi cảnh báo lại sau

source: Number of iterations
vi: Số lần lặp

source: times
vi: lần

source: Warning
vi: Cảnh báo
